betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2s.c
/**
  *
  * @file    apm32f4xx_dal_i2s.c
  * @brief   I2S DAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Integrated Interchip Sound (I2S) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and Errors functions
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
 ===============================================================================
                  ##### How to use this driver #####
 ===============================================================================
 [..]
    The I2S DAL driver can be used as follow:

    (#) Declare a I2S_HandleTypeDef handle structure.
    (#) Initialize the I2S low level resources by implement the DAL_I2S_MspInit() API:
        (##) Enable the SPIx interface clock.
        (##) I2S pins configuration:
            (+++) Enable the clock for the I2S GPIOs.
            (+++) Configure these I2S pins as alternate function pull-up.
        (##) NVIC configuration if you need to use interrupt process (DAL_I2S_Transmit_IT()
             and DAL_I2S_Receive_IT() APIs).
            (+++) Configure the I2Sx interrupt priority.
            (+++) Enable the NVIC I2S IRQ handle.
        (##) DMA Configuration if you need to use DMA process (DAL_I2S_Transmit_DMA()
             and DAL_I2S_Receive_DMA() APIs:
            (+++) Declare a DMA handle structure for the Tx/Rx Stream/Channel.
            (+++) Enable the DMAx interface clock.
            (+++) Configure the declared DMA handle structure with the required Tx/Rx parameters.
            (+++) Configure the DMA Tx/Rx Stream/Channel.
            (+++) Associate the initialized DMA handle to the I2S DMA Tx/Rx handle.
            (+++) Configure the priority and enable the NVIC for the transfer complete interrupt on the
                  DMA Tx/Rx Stream/Channel.

   (#) Program the Mode, Standard, Data Format, MCLK Output, Audio frequency and Polarity
       using DAL_I2S_Init() function.

   -@- The specific I2S interrupts (Transmission complete interrupt,
       RXNE interrupt and Error Interrupts) will be managed using the macros
       __DAL_I2S_ENABLE_IT() and __DAL_I2S_DISABLE_IT() inside the transmit and receive process.
   -@- Make sure that either:
        (+@) I2S PLL clock is configured or
        (+@) External clock source is configured after setting correctly
             the define constant EXTERNAL_CLOCK_VALUE in the apm32f4xx_dal_cfg.h file.

    (#) Three mode of operations are available within this driver :

   *** Polling mode IO operation ***
   =================================
   [..]
     (+) Send an amount of data in blocking mode using DAL_I2S_Transmit()
     (+) Receive an amount of data in blocking mode using DAL_I2S_Receive()

   *** Interrupt mode IO operation ***
   ===================================
   [..]
     (+) Send an amount of data in non blocking mode using DAL_I2S_Transmit_IT()
     (+) At transmission end of half transfer DAL_I2S_TxHalfCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_TxHalfCpltCallback
     (+) At transmission end of transfer DAL_I2S_TxCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_TxCpltCallback
     (+) Receive an amount of data in non blocking mode using DAL_I2S_Receive_IT()
     (+) At reception end of half transfer DAL_I2S_RxHalfCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_RxHalfCpltCallback
     (+) At reception end of transfer DAL_I2S_RxCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_RxCpltCallback
     (+) In case of transfer Error, DAL_I2S_ErrorCallback() function is executed and user can
         add his own code by customization of function pointer DAL_I2S_ErrorCallback

   *** DMA mode IO operation ***
   ==============================
   [..]
     (+) Send an amount of data in non blocking mode (DMA) using DAL_I2S_Transmit_DMA()
     (+) At transmission end of half transfer DAL_I2S_TxHalfCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_TxHalfCpltCallback
     (+) At transmission end of transfer DAL_I2S_TxCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_TxCpltCallback
     (+) Receive an amount of data in non blocking mode (DMA) using DAL_I2S_Receive_DMA()
     (+) At reception end of half transfer DAL_I2S_RxHalfCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_RxHalfCpltCallback
     (+) At reception end of transfer DAL_I2S_RxCpltCallback is executed and user can
         add his own code by customization of function pointer DAL_I2S_RxCpltCallback
     (+) In case of transfer Error, DAL_I2S_ErrorCallback() function is executed and user can
         add his own code by customization of function pointer DAL_I2S_ErrorCallback
     (+) Pause the DMA Transfer using DAL_I2S_DMAPause()
     (+) Resume the DMA Transfer using DAL_I2S_DMAResume()
     (+) Stop the DMA Transfer using DAL_I2S_DMAStop()
         In Slave mode, if DAL_I2S_DMAStop is used to stop the communication, an error
         DAL_I2S_ERROR_BUSY_LINE_RX is raised as the master continue to transmit data.
         In this case __DAL_I2S_FLUSH_RX_DR macro must be used to flush the remaining data
         inside DATA register and avoid using DeInit/Init process for the next transfer.

   *** I2S DAL driver macros list ***
   ===================================
   [..]
     Below the list of most used macros in I2S DAL driver.

      (+) __DAL_I2S_ENABLE: Enable the specified SPI peripheral (in I2S mode)
      (+) __DAL_I2S_DISABLE: Disable the specified SPI peripheral (in I2S mode)
      (+) __DAL_I2S_ENABLE_IT : Enable the specified I2S interrupts
      (+) __DAL_I2S_DISABLE_IT : Disable the specified I2S interrupts
      (+) __DAL_I2S_GET_FLAG: Check whether the specified I2S flag is set or not
      (+) __DAL_I2S_FLUSH_RX_DR: Read DATA Register to Flush RX Data

