betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2s.c
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    hi2s->MspInitCallback(hi2s);
#else
    /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
    DAL_I2S_MspInit(hi2s);
#endif /* USE_DAL_I2S_REGISTER_CALLBACKS */
  }

  hi2s->State = DAL_I2S_STATE_BUSY;

  /*----------------------- SPIx I2SCFGR & I2SPR Configuration ----------------*/
  /* Clear I2SMOD, I2SE, I2SCFG, PCMSYNC, I2SSTD, CKPOL, DATLEN and CHLEN bits */
  CLEAR_BIT(hi2s->Instance->I2SCFG, (SPI_I2SCFG_CHLEN | SPI_I2SCFG_DATALEN | SPI_I2SCFG_CPOL | \
                                      SPI_I2SCFG_I2SSSEL | SPI_I2SCFG_PFSSEL | SPI_I2SCFG_I2SMOD | \
                                      SPI_I2SCFG_I2SEN | SPI_I2SCFG_MODESEL));
  hi2s->Instance->I2SPSC = 0x0002U;

  /*----------------------- I2SPR: I2SDIV and ODD Calculation -----------------*/
  /* If the requested audio frequency is not the default, compute the prescaler */
  if (hi2s->Init.AudioFreq != I2S_AUDIOFREQ_DEFAULT)
  {
    /* Check the frame length (For the Prescaler computing) ********************/
    if (hi2s->Init.DataFormat == I2S_DATAFORMAT_16B)
    {
      /* Packet length is 16 bits */
      packetlength = 16U;
    }
    else
    {
      /* Packet length is 32 bits */
      packetlength = 32U;
    }

    /* I2S standard */
    if (hi2s->Init.Standard <= I2S_STANDARD_LSB)
    {
      /* In I2S standard packet length is multiplied by 2 */
      packetlength = packetlength * 2U;
    }

    /* Get the source clock value **********************************************/
#if defined(APM32F403xx) || defined(APM32F402xx)
    i2sclk = DAL_RCMEx_GetPeriphCLKFreq(RCM_PERIPHCLK_I2S2);
#else
    i2sclk = DAL_RCMEx_GetPeriphCLKFreq(RCM_PERIPHCLK_I2S);
#endif /* APM32F403xx || APM32F402xx */

    /* Compute the Real divider depending on the MCLK output state, with a floating point */
    if (hi2s->Init.MCLKOutput == I2S_MCLKOUTPUT_ENABLE)
    {
      /* MCLK output is enabled */
      if (hi2s->Init.DataFormat != I2S_DATAFORMAT_16B)
      {
        tmp = (uint32_t)(((((i2sclk / (packetlength * 4U)) * 10U) / hi2s->Init.AudioFreq)) + 5U);
      }
      else
      {
        tmp = (uint32_t)(((((i2sclk / (packetlength * 8U)) * 10U) / hi2s->Init.AudioFreq)) + 5U);
      }
    }
    else
    {
      /* MCLK output is disabled */
      tmp = (uint32_t)(((((i2sclk / packetlength) * 10U) / hi2s->Init.AudioFreq)) + 5U);
    }

    /* Remove the flatting point */
    tmp = tmp / 10U;

    /* Check the parity of the divider */
    i2sodd = (uint32_t)(tmp & (uint32_t)1U);

    /* Compute the i2sdiv prescaler */
    i2sdiv = (uint32_t)((tmp - i2sodd) / 2U);

    /* Get the Mask for the Odd bit (SPI_I2SPSC[8]) register */
    i2sodd = (uint32_t)(i2sodd << 8U);
  }
  else
  {
    /* Set the default values */
    i2sdiv = 2U;
    i2sodd = 0U;
  }

  /* Test if the divider is 1 or 0 or greater than 0xFF */
  if ((i2sdiv < 2U) || (i2sdiv > 0xFFU))
  {
    /* Set the error code and execute error callback*/
    SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_PRESCALER);
    return  DAL_ERROR;
  }

  /*----------------------- SPIx I2SCFG & I2SPSC Configuration ----------------*/

  /* Write to SPIx I2SPSC register the computed value */
  hi2s->Instance->I2SPSC = (uint32_t)((uint32_t)i2sdiv | (uint32_t)(i2sodd | (uint32_t)hi2s->Init.MCLKOutput));

  /* Clear CHLEN, DATALEN, CPOL, I2SSSEL, PFSSEL, I2SMOD, I2SEN and MODESEL bits */
  /* And configure the I2S with the I2S_InitStruct values                      */
  MODIFY_REG(hi2s->Instance->I2SCFG, (SPI_I2SCFG_CHLEN | SPI_I2SCFG_DATALEN | \
                                       SPI_I2SCFG_CPOL | SPI_I2SCFG_I2SSSEL | \
                                       SPI_I2SCFG_PFSSEL | SPI_I2SCFG_I2SMOD | \
                                       SPI_I2SCFG_I2SEN  | SPI_I2SCFG_MODESEL), \
             (SPI_I2SCFG_MODESEL | hi2s->Init.Mode | \
              hi2s->Init.Standard | hi2s->Init.DataFormat | \
              hi2s->Init.CPOL));

#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)

  /* Configure the I2S extended if the full duplex mode is enabled */
  ASSERT_PARAM(IS_I2S_FULLDUPLEX_MODE(hi2s->Init.FullDuplexMode));

  if (hi2s->Init.FullDuplexMode == I2S_FULLDUPLEXMODE_ENABLE)
  {
    /* Set FullDuplex I2S IrqHandler ISR if FULLDUPLEXMODE is enabled */
    hi2s->IrqHandlerISR = DAL_I2SEx_FullDuplex_IRQHandler;

    /* Clear CHLEN, DATALEN, CPOL, I2SSSEL, PFSSEL, I2SMOD, I2SEN and MODESEL bits */
    CLEAR_BIT(I2SxEXT(hi2s->Instance)->I2SCFG, (SPI_I2SCFG_CHLEN | SPI_I2SCFG_DATALEN | SPI_I2SCFG_CPOL | \
                                                 SPI_I2SCFG_I2SSSEL | SPI_I2SCFG_PFSSEL | SPI_I2SCFG_I2SMOD | \
                                                 SPI_I2SCFG_I2SEN | SPI_I2SCFG_MODESEL));
    I2SxEXT(hi2s->Instance)->I2SPSC = 2U;

    /* Get the I2SCFG register value */
    tmpreg = I2SxEXT(hi2s->Instance)->I2SCFG;

    /* Get the mode to be configured for the extended I2S */
    if ((hi2s->Init.Mode == I2S_MODE_MASTER_TX) || (hi2s->Init.Mode == I2S_MODE_SLAVE_TX))
    {
      tmp = I2S_MODE_SLAVE_RX;
    }
    else /* I2S_MODE_MASTER_RX ||  I2S_MODE_SLAVE_RX */
    {
      tmp = I2S_MODE_SLAVE_TX;
    }

    /* Configure the I2S Slave with the I2S Master parameter values */
    tmpreg |= (uint16_t)((uint16_t)SPI_I2SCFG_MODESEL    | \
                         (uint16_t)tmp                   | \
                         (uint16_t)hi2s->Init.Standard   | \
                         (uint16_t)hi2s->Init.DataFormat | \
                         (uint16_t)hi2s->Init.CPOL);

    /* Write to SPIx I2SCFG */
    WRITE_REG(I2SxEXT(hi2s->Instance)->I2SCFG, tmpreg);
  }
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

  hi2s->ErrorCode = DAL_I2S_ERROR_NONE;
  hi2s->State     = DAL_I2S_STATE_READY;

  return DAL_OK;
}

/**
  * @brief DeInitializes the I2S peripheral
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_DeInit(I2S_HandleTypeDef *hi2s)
{
  /* Check the I2S handle allocation */
  if (hi2s == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_I2S_ALL_INSTANCE(hi2s->Instance));

  hi2s->State = DAL_I2S_STATE_BUSY;

  /* Disable the I2S Peripheral Clock */
  __DAL_I2S_DISABLE(hi2s);

#if (USE_DAL_I2S_REGISTER_CALLBACKS == 1U)
  if (hi2s->MspDeInitCallback == NULL)
  {
    hi2s->MspDeInitCallback = DAL_I2S_MspDeInit; /* Legacy weak MspDeInit  */
  }

