betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2s.c
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  hi2s->MspDeInitCallback(hi2s);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  DAL_I2S_MspDeInit(hi2s);
#endif /* USE_DAL_I2S_REGISTER_CALLBACKS */

  hi2s->ErrorCode = DAL_I2S_ERROR_NONE;
  hi2s->State     = DAL_I2S_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(hi2s);

  return DAL_OK;
}

/**
  * @brief I2S MSP Init
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
__weak void DAL_I2S_MspInit(I2S_HandleTypeDef *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hi2s);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_I2S_MspInit could be implemented in the user file
   */
}

/**
  * @brief I2S MSP DeInit
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
__weak void DAL_I2S_MspDeInit(I2S_HandleTypeDef *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hi2s);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_I2S_MspDeInit could be implemented in the user file
   */
}

#if (USE_DAL_I2S_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User I2S Callback
  *         To be used instead of the weak predefined callback
  * @param  hi2s Pointer to a I2S_HandleTypeDef structure that contains
  *                the configuration information for the specified I2S.
  * @param  CallbackID ID of the callback to be registered
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_RegisterCallback(I2S_HandleTypeDef *hi2s, DAL_I2S_CallbackIDTypeDef CallbackID,
                                           pI2S_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hi2s->ErrorCode |= DAL_I2S_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(hi2s);

  if (DAL_I2S_STATE_READY == hi2s->State)
  {
    switch (CallbackID)
    {
      case DAL_I2S_TX_COMPLETE_CB_ID :
        hi2s->TxCpltCallback = pCallback;
        break;

      case DAL_I2S_RX_COMPLETE_CB_ID :
        hi2s->RxCpltCallback = pCallback;
        break;

#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
      case DAL_I2S_TX_RX_COMPLETE_CB_ID :
        hi2s->TxRxCpltCallback = pCallback;
        break;
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

      case DAL_I2S_TX_HALF_COMPLETE_CB_ID :
        hi2s->TxHalfCpltCallback = pCallback;
        break;

      case DAL_I2S_RX_HALF_COMPLETE_CB_ID :
        hi2s->RxHalfCpltCallback = pCallback;
        break;

#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
      case DAL_I2S_TX_RX_HALF_COMPLETE_CB_ID :
        hi2s->TxRxHalfCpltCallback = pCallback;
        break;
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

      case DAL_I2S_ERROR_CB_ID :
        hi2s->ErrorCallback = pCallback;
        break;

      case DAL_I2S_MSPINIT_CB_ID :
        hi2s->MspInitCallback = pCallback;
        break;

      case DAL_I2S_MSPDEINIT_CB_ID :
        hi2s->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_I2S_STATE_RESET == hi2s->State)
  {
    switch (CallbackID)
    {
      case DAL_I2S_MSPINIT_CB_ID :
        hi2s->MspInitCallback = pCallback;
        break;

      case DAL_I2S_MSPDEINIT_CB_ID :
        hi2s->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_INVALID_CALLBACK);

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hi2s);
  return status;
}

/**
  * @brief  Unregister an I2S Callback
  *         I2S callback is redirected to the weak predefined callback
  * @param  hi2s Pointer to a I2S_HandleTypeDef structure that contains
  *                the configuration information for the specified I2S.
  * @param  CallbackID ID of the callback to be unregistered
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_UnRegisterCallback(I2S_HandleTypeDef *hi2s, DAL_I2S_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hi2s);

  if (DAL_I2S_STATE_READY == hi2s->State)
  {
    switch (CallbackID)
    {
      case DAL_I2S_TX_COMPLETE_CB_ID :
        hi2s->TxCpltCallback = DAL_I2S_TxCpltCallback;                /* Legacy weak TxCpltCallback       */
        break;

      case DAL_I2S_RX_COMPLETE_CB_ID :
        hi2s->RxCpltCallback = DAL_I2S_RxCpltCallback;                /* Legacy weak RxCpltCallback       */
        break;

#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
      case DAL_I2S_TX_RX_COMPLETE_CB_ID :
        hi2s->TxRxCpltCallback = DAL_I2SEx_TxRxCpltCallback;          /* Legacy weak TxRxCpltCallback     */
        break;
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

      case DAL_I2S_TX_HALF_COMPLETE_CB_ID :
        hi2s->TxHalfCpltCallback = DAL_I2S_TxHalfCpltCallback;        /* Legacy weak TxHalfCpltCallback   */
        break;

      case DAL_I2S_RX_HALF_COMPLETE_CB_ID :
        hi2s->RxHalfCpltCallback = DAL_I2S_RxHalfCpltCallback;        /* Legacy weak RxHalfCpltCallback   */
        break;

#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
      case DAL_I2S_TX_RX_HALF_COMPLETE_CB_ID :
        hi2s->TxRxHalfCpltCallback = DAL_I2SEx_TxRxHalfCpltCallback;  /* Legacy weak TxRxHalfCpltCallback */
        break;
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

      case DAL_I2S_ERROR_CB_ID :
        hi2s->ErrorCallback = DAL_I2S_ErrorCallback;                  /* Legacy weak ErrorCallback        */
        break;

      case DAL_I2S_MSPINIT_CB_ID :
        hi2s->MspInitCallback = DAL_I2S_MspInit;                      /* Legacy weak MspInit              */
        break;

      case DAL_I2S_MSPDEINIT_CB_ID :
        hi2s->MspDeInitCallback = DAL_I2S_MspDeInit;                  /* Legacy weak MspDeInit            */
        break;

      default :
        /* Update the error code */
        SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_I2S_STATE_RESET == hi2s->State)
  {
    switch (CallbackID)
    {
      case DAL_I2S_MSPINIT_CB_ID :
        hi2s->MspInitCallback = DAL_I2S_MspInit;                      /* Legacy weak MspInit              */
        break;

      case DAL_I2S_MSPDEINIT_CB_ID :
        hi2s->MspDeInitCallback = DAL_I2S_MspDeInit;                  /* Legacy weak MspDeInit            */
        break;

      default :
        /* Update the error code */
        SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_INVALID_CALLBACK);

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_INVALID_CALLBACK);

    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hi2s);
  return status;
}
#endif /* USE_DAL_I2S_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup I2S_Exported_Functions_Group2 IO operation functions
  *  @brief Data transfers functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the I2S data
    transfers.

    (#) There are two modes of transfer:
       (++) Blocking mode : The communication is performed in the polling mode.
            The status of all data processing is returned by the same function
            after finishing transfer.
       (++) No-Blocking mode : The communication is performed using Interrupts
            or DMA. These functions return the status of the transfer startup.
            The end of the data processing will be indicated through the
            dedicated I2S IRQ when using Interrupt mode or the DMA IRQ when
            using DMA mode.

    (#) Blocking mode functions are :
        (++) DAL_I2S_Transmit()
        (++) DAL_I2S_Receive()

