betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2s.c
    (#) No-Blocking mode functions with Interrupt are :
        (++) DAL_I2S_Transmit_IT()
        (++) DAL_I2S_Receive_IT()

    (#) No-Blocking mode functions with DMA are :
        (++) DAL_I2S_Transmit_DMA()
        (++) DAL_I2S_Receive_DMA()

    (#) A set of Transfer Complete Callbacks are provided in non Blocking mode:
        (++) DAL_I2S_TxCpltCallback()
        (++) DAL_I2S_RxCpltCallback()
        (++) DAL_I2S_ErrorCallback()

@endverbatim
  * @{
  */

/**
  * @brief  Transmit an amount of data in blocking mode
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @param  pData a 16-bit pointer to data buffer.
  * @param  Size number of data sample to be sent:
  * @note   When a 16-bit data frame or a 16-bit data frame extended is selected during the I2S
  *         configuration phase, the Size parameter means the number of 16-bit data length
  *         in the transaction and when a 24-bit data frame or a 32-bit data frame is selected
  *         the Size parameter means the number of 24-bit or 32-bit data length.
  * @param  Timeout Timeout duration
  * @note   The I2S is kept enabled at the end of transaction to avoid the clock de-synchronization
  *         between Master and Slave(example: audio streaming).
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_Transmit(I2S_HandleTypeDef *hi2s, uint16_t *pData, uint16_t Size, uint32_t Timeout)
{
  uint32_t tmpreg_cfgr;

  if ((pData == NULL) || (Size == 0U))
  {
    return  DAL_ERROR;
  }

  /* Process Locked */
  __DAL_LOCK(hi2s);

  if (hi2s->State != DAL_I2S_STATE_READY)
  {
    __DAL_UNLOCK(hi2s);
    return DAL_BUSY;
  }

  /* Set state and reset error code */
  hi2s->State = DAL_I2S_STATE_BUSY_TX;
  hi2s->ErrorCode = DAL_I2S_ERROR_NONE;
  hi2s->pTxBuffPtr = pData;

  tmpreg_cfgr = hi2s->Instance->I2SCFG & (SPI_I2SCFG_DATALEN | SPI_I2SCFG_CHLEN);

  if ((tmpreg_cfgr == I2S_DATAFORMAT_24B) || (tmpreg_cfgr == I2S_DATAFORMAT_32B))
  {
    hi2s->TxXferSize = (Size << 1U);
    hi2s->TxXferCount = (Size << 1U);
  }
  else
  {
    hi2s->TxXferSize = Size;
    hi2s->TxXferCount = Size;
  }

  tmpreg_cfgr = hi2s->Instance->I2SCFG;

  /* Check if the I2S is already enabled */
  if ((hi2s->Instance->I2SCFG & SPI_I2SCFG_I2SEN) != SPI_I2SCFG_I2SEN)
  {
    /* Enable I2S peripheral */
    __DAL_I2S_ENABLE(hi2s);
  }

  /* Wait until TXE flag is set */
  if (I2S_WaitFlagStateUntilTimeout(hi2s, I2S_FLAG_TXE, SET, Timeout) != DAL_OK)
  {
    /* Set the error code */
    SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);
    hi2s->State = DAL_I2S_STATE_READY;
    __DAL_UNLOCK(hi2s);
    return DAL_ERROR;
  }

  while (hi2s->TxXferCount > 0U)
  {
    hi2s->Instance->DATA = (*hi2s->pTxBuffPtr);
    hi2s->pTxBuffPtr++;
    hi2s->TxXferCount--;

    /* Wait until TXE flag is set */
    if (I2S_WaitFlagStateUntilTimeout(hi2s, I2S_FLAG_TXE, SET, Timeout) != DAL_OK)
    {
      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);
      hi2s->State = DAL_I2S_STATE_READY;
      __DAL_UNLOCK(hi2s);
      return DAL_ERROR;
    }

    /* Check if an underrun occurs */
    if (__DAL_I2S_GET_FLAG(hi2s, I2S_FLAG_UDR) == SET)
    {
      /* Clear underrun flag */
      __DAL_I2S_CLEAR_UDRFLAG(hi2s);

      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_UDR);
    }
  }

  /* Check if Slave mode is selected */
  if (((tmpreg_cfgr & SPI_I2SCFG_I2SMOD) == I2S_MODE_SLAVE_TX)
      || ((tmpreg_cfgr & SPI_I2SCFG_I2SMOD) == I2S_MODE_SLAVE_RX))
  {
    /* Wait until Busy flag is reset */
    if (I2S_WaitFlagStateUntilTimeout(hi2s, I2S_FLAG_BSY, RESET, Timeout) != DAL_OK)
    {
      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);
      hi2s->State = DAL_I2S_STATE_READY;
      __DAL_UNLOCK(hi2s);
      return DAL_ERROR;
    }
  }

  hi2s->State = DAL_I2S_STATE_READY;
  __DAL_UNLOCK(hi2s);
  return DAL_OK;
}

/**
  * @brief  Receive an amount of data in blocking mode
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @param  pData a 16-bit pointer to data buffer.
  * @param  Size number of data sample to be sent:
  * @note   When a 16-bit data frame or a 16-bit data frame extended is selected during the I2S
  *         configuration phase, the Size parameter means the number of 16-bit data length
  *         in the transaction and when a 24-bit data frame or a 32-bit data frame is selected
  *         the Size parameter means the number of 24-bit or 32-bit data length.
  * @param  Timeout Timeout duration
  * @note   The I2S is kept enabled at the end of transaction to avoid the clock de-synchronization
  *         between Master and Slave(example: audio streaming).
  * @note   In I2S Master Receiver mode, just after enabling the peripheral the clock will be generate
  *         in continuous way and as the I2S is not disabled at the end of the I2S transaction.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_Receive(I2S_HandleTypeDef *hi2s, uint16_t *pData, uint16_t Size, uint32_t Timeout)
{
  uint32_t tmpreg_cfgr;

  if ((pData == NULL) || (Size == 0U))
  {
    return  DAL_ERROR;
  }

  /* Process Locked */
  __DAL_LOCK(hi2s);

  if (hi2s->State != DAL_I2S_STATE_READY)
  {
    __DAL_UNLOCK(hi2s);
    return DAL_BUSY;
  }

  /* Set state and reset error code */
  hi2s->State = DAL_I2S_STATE_BUSY_RX;
  hi2s->ErrorCode = DAL_I2S_ERROR_NONE;
  hi2s->pRxBuffPtr = pData;

  tmpreg_cfgr = hi2s->Instance->I2SCFG & (SPI_I2SCFG_DATALEN | SPI_I2SCFG_CHLEN);

  if ((tmpreg_cfgr == I2S_DATAFORMAT_24B) || (tmpreg_cfgr == I2S_DATAFORMAT_32B))
  {
    hi2s->RxXferSize = (Size << 1U);
    hi2s->RxXferCount = (Size << 1U);
  }
  else
  {
    hi2s->RxXferSize = Size;
    hi2s->RxXferCount = Size;
  }

  /* Check if the I2S is already enabled */
  if ((hi2s->Instance->I2SCFG & SPI_I2SCFG_I2SEN) != SPI_I2SCFG_I2SEN)
  {
    /* Enable I2S peripheral */
    __DAL_I2S_ENABLE(hi2s);
  }

  /* Check if Master Receiver mode is selected */
  if ((hi2s->Instance->I2SCFG & SPI_I2SCFG_I2SMOD) == I2S_MODE_MASTER_RX)
  {
    /* Clear the Overrun Flag by a read operation on the SPI_DATA register followed by a read
    access to the SPI_STS register. */
    __DAL_I2S_CLEAR_OVRFLAG(hi2s);
  }

  /* Receive data */
  while (hi2s->RxXferCount > 0U)
  {
    /* Wait until RXNE flag is set */
    if (I2S_WaitFlagStateUntilTimeout(hi2s, I2S_FLAG_RXNE, SET, Timeout) != DAL_OK)
    {
      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);
      hi2s->State = DAL_I2S_STATE_READY;
      __DAL_UNLOCK(hi2s);
      return DAL_ERROR;
    }

    (*hi2s->pRxBuffPtr) = (uint16_t)hi2s->Instance->DATA;
    hi2s->pRxBuffPtr++;
    hi2s->RxXferCount--;

    /* Check if an overrun occurs */
    if (__DAL_I2S_GET_FLAG(hi2s, I2S_FLAG_OVR) == SET)
    {
      /* Clear overrun flag */
      __DAL_I2S_CLEAR_OVRFLAG(hi2s);

      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_OVR);
    }
  }

