betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2s.c
  /* Set the I2S Tx DMA transfer complete callback */
  hi2s->hdmatx->XferCpltCallback = I2S_DMATxCplt;

  /* Set the DMA error callback */
  hi2s->hdmatx->XferErrorCallback = I2S_DMAError;

  /* Enable the Tx DMA Stream/Channel */
  if (DAL_OK != DAL_DMA_Start_IT(hi2s->hdmatx,
                                 (uint32_t)hi2s->pTxBuffPtr,
                                 (uint32_t)&hi2s->Instance->DATA,
                                 hi2s->TxXferSize))
  {
    /* Update SPI error code */
    SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_DMA);
    hi2s->State = DAL_I2S_STATE_READY;

    __DAL_UNLOCK(hi2s);
    return DAL_ERROR;
  }

  /* Check if the I2S is already enabled */
  if (DAL_IS_BIT_CLR(hi2s->Instance->I2SCFG, SPI_I2SCFG_I2SEN))
  {
    /* Enable I2S peripheral */
    __DAL_I2S_ENABLE(hi2s);
  }

  /* Check if the I2S Tx request is already enabled */
  if (DAL_IS_BIT_CLR(hi2s->Instance->CTRL2, SPI_CTRL2_TXDEN))
  {
    /* Enable Tx DMA Request */
    SET_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_TXDEN);
  }

  __DAL_UNLOCK(hi2s);
  return DAL_OK;
}

/**
  * @brief  Receive an amount of data in non-blocking mode with DMA
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @param  pData a 16-bit pointer to the Receive data buffer.
  * @param  Size number of data sample to be sent:
  * @note   When a 16-bit data frame or a 16-bit data frame extended is selected during the I2S
  *         configuration phase, the Size parameter means the number of 16-bit data length
  *         in the transaction and when a 24-bit data frame or a 32-bit data frame is selected
  *         the Size parameter means the number of 24-bit or 32-bit data length.
  * @note   The I2S is kept enabled at the end of transaction to avoid the clock de-synchronization
  *         between Master and Slave(example: audio streaming).
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_Receive_DMA(I2S_HandleTypeDef *hi2s, uint16_t *pData, uint16_t Size)
{
  uint32_t tmpreg_cfgr;

  if ((pData == NULL) || (Size == 0U))
  {
    return  DAL_ERROR;
  }

  /* Process Locked */
  __DAL_LOCK(hi2s);

  if (hi2s->State != DAL_I2S_STATE_READY)
  {
    __DAL_UNLOCK(hi2s);
    return DAL_BUSY;
  }

  /* Set state and reset error code */
  hi2s->State = DAL_I2S_STATE_BUSY_RX;
  hi2s->ErrorCode = DAL_I2S_ERROR_NONE;
  hi2s->pRxBuffPtr = pData;

  tmpreg_cfgr = hi2s->Instance->I2SCFG & (SPI_I2SCFG_DATALEN | SPI_I2SCFG_CHLEN);

  if ((tmpreg_cfgr == I2S_DATAFORMAT_24B) || (tmpreg_cfgr == I2S_DATAFORMAT_32B))
  {
    hi2s->RxXferSize = (Size << 1U);
    hi2s->RxXferCount = (Size << 1U);
  }
  else
  {
    hi2s->RxXferSize = Size;
    hi2s->RxXferCount = Size;
  }

  /* Set the I2S Rx DMA Half transfer complete callback */
  hi2s->hdmarx->XferHalfCpltCallback = I2S_DMARxHalfCplt;

  /* Set the I2S Rx DMA transfer complete callback */
  hi2s->hdmarx->XferCpltCallback = I2S_DMARxCplt;

  /* Set the DMA error callback */
  hi2s->hdmarx->XferErrorCallback = I2S_DMAError;

  /* Check if Master Receiver mode is selected */
  if ((hi2s->Instance->I2SCFG & SPI_I2SCFG_I2SMOD) == I2S_MODE_MASTER_RX)
  {
    /* Clear the Overrun Flag by a read operation to the SPI_DATA register followed by a read
    access to the SPI_STS register. */
    __DAL_I2S_CLEAR_OVRFLAG(hi2s);
  }

  /* Enable the Rx DMA Stream/Channel */
  if (DAL_OK != DAL_DMA_Start_IT(hi2s->hdmarx, (uint32_t)&hi2s->Instance->DATA, (uint32_t)hi2s->pRxBuffPtr,
                                 hi2s->RxXferSize))
  {
    /* Update SPI error code */
    SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_DMA);
    hi2s->State = DAL_I2S_STATE_READY;

    __DAL_UNLOCK(hi2s);
    return DAL_ERROR;
  }

  /* Check if the I2S is already enabled */
  if (DAL_IS_BIT_CLR(hi2s->Instance->I2SCFG, SPI_I2SCFG_I2SEN))
  {
    /* Enable I2S peripheral */
    __DAL_I2S_ENABLE(hi2s);
  }

  /* Check if the I2S Rx request is already enabled */
  if (DAL_IS_BIT_CLR(hi2s->Instance->CTRL2, SPI_CTRL2_RXDEN))
  {
    /* Enable Rx DMA Request */
    SET_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_RXDEN);
  }

  __DAL_UNLOCK(hi2s);
  return DAL_OK;
}

/**
  * @brief  Pauses the audio DMA Stream/Channel playing from the Media.
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_DMAPause(I2S_HandleTypeDef *hi2s)
{
  /* Process Locked */
  __DAL_LOCK(hi2s);

  if (hi2s->State == DAL_I2S_STATE_BUSY_TX)
  {
    /* Disable the I2S DMA Tx request */
    CLEAR_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_TXDEN);
  }
  else if (hi2s->State == DAL_I2S_STATE_BUSY_RX)
  {
    /* Disable the I2S DMA Rx request */
    CLEAR_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_RXDEN);
  }
#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
  else if (hi2s->State == DAL_I2S_STATE_BUSY_TX_RX)
  {
    /* Pause the audio file playing by disabling the I2S DMA request */
    CLEAR_BIT(hi2s->Instance->CTRL2, (SPI_CTRL2_TXDEN | SPI_CTRL2_RXDEN));
    CLEAR_BIT(I2SxEXT(hi2s->Instance)->CTRL2, (SPI_CTRL2_TXDEN | SPI_CTRL2_RXDEN));
  }
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */
  else
  {
    /* nothing to do */
  }

  /* Process Unlocked */
  __DAL_UNLOCK(hi2s);

  return DAL_OK;
}

/**
  * @brief  Resumes the audio DMA Stream/Channel playing from the Media.
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_DMAResume(I2S_HandleTypeDef *hi2s)
{
  /* Process Locked */
  __DAL_LOCK(hi2s);

  if (hi2s->State == DAL_I2S_STATE_BUSY_TX)
  {
    /* Enable the I2S DMA Tx request */
    SET_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_TXDEN);
  }
  else if (hi2s->State == DAL_I2S_STATE_BUSY_RX)
  {
    /* Enable the I2S DMA Rx request */
    SET_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_RXDEN);
  }
#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
  else if (hi2s->State == DAL_I2S_STATE_BUSY_TX_RX)
  {
    /* Pause the audio file playing by disabling the I2S DMA request */
    SET_BIT(hi2s->Instance->CTRL2, (SPI_CTRL2_RXDEN | SPI_CTRL2_TXDEN));
    SET_BIT(I2SxEXT(hi2s->Instance)->CTRL2, (SPI_CTRL2_RXDEN | SPI_CTRL2_TXDEN));

    /* If the I2Sext peripheral is still not enabled, enable it */
    if ((I2SxEXT(hi2s->Instance)->I2SCFG & SPI_I2SCFG_I2SEN) == 0U)
    {
      /* Enable I2Sext peripheral */
      __DAL_I2SEXT_ENABLE(hi2s);
    }
  }
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */
  else
  {
    /* nothing to do */
  }

  /* If the I2S peripheral is still not enabled, enable it */
  if (DAL_IS_BIT_CLR(hi2s->Instance->I2SCFG, SPI_I2SCFG_I2SEN))
  {
    /* Enable I2S peripheral */
    __DAL_I2S_ENABLE(hi2s);
  }

  /* Process Unlocked */
  __DAL_UNLOCK(hi2s);

  return DAL_OK;
}

/**
  * @brief  Stops the audio DMA Stream/Channel playing from the Media.
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_I2S_DMAStop(I2S_HandleTypeDef *hi2s)
{
#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)
  uint32_t tickstart;
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */
  DAL_StatusTypeDef errorcode = DAL_OK;
  /* The Lock is not implemented on this API to allow the user application
     to call the DAL SPI API under callbacks DAL_I2S_TxCpltCallback() or DAL_I2S_RxCpltCallback()
     when calling DAL_DMA_Abort() API the DMA TX or RX Transfer complete interrupt is generated
     and the correspond call back is executed DAL_I2S_TxCpltCallback() or DAL_I2S_RxCpltCallback()
     */

  if ((hi2s->Init.Mode == I2S_MODE_MASTER_TX) || (hi2s->Init.Mode == I2S_MODE_SLAVE_TX))
  {
    /* Abort the I2S DMA tx Stream/Channel */
    if (hi2s->hdmatx != NULL)
    {
      /* Disable the I2S DMA tx Stream/Channel */
      if (DAL_OK != DAL_DMA_Abort(hi2s->hdmatx))
      {
        SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_DMA);
        errorcode = DAL_ERROR;
      }
    }

    /* Wait until TXE flag is set */
    if (I2S_WaitFlagStateUntilTimeout(hi2s, I2S_FLAG_TXE, SET, I2S_TIMEOUT_FLAG) != DAL_OK)
    {
      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);
      hi2s->State = DAL_I2S_STATE_READY;
      errorcode   = DAL_ERROR;
    }

