betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_i2s.c
    /* Wait until BSY flag is Reset */
    if (I2S_WaitFlagStateUntilTimeout(hi2s, I2S_FLAG_BSY, RESET, I2S_TIMEOUT_FLAG) != DAL_OK)
    {
      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);
      hi2s->State = DAL_I2S_STATE_READY;
      errorcode   = DAL_ERROR;
    }

    /* Disable I2S peripheral */
    __DAL_I2S_DISABLE(hi2s);

    /* Clear UDR flag */
    __DAL_I2S_CLEAR_UDRFLAG(hi2s);

    /* Disable the I2S Tx DMA requests */
    CLEAR_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_TXDEN);

#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)

    if (hi2s->State == DAL_I2S_STATE_BUSY_TX_RX)
    {
      /* Abort the I2S DMA rx Stream/Channel */
      if (hi2s->hdmarx != NULL)
      {
        /* Disable the I2S DMA rx Stream/Channel */
        if (DAL_OK != DAL_DMA_Abort(hi2s->hdmarx))
        {
          SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_DMA);
          errorcode = DAL_ERROR;
        }
      }

      /* Disable I2Sext peripheral */
      __DAL_I2SEXT_DISABLE(hi2s);

      /* Clear OVR flag */
      __DAL_I2SEXT_CLEAR_OVRFLAG(hi2s);

      /* Disable the I2SxEXT DMA request */
      CLEAR_BIT(I2SxEXT(hi2s->Instance)->CTRL2, SPI_CTRL2_RXDEN);

      if (hi2s->Init.Mode == I2S_MODE_SLAVE_TX)
      {
        /* Set the error code */
        SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_BUSY_LINE_RX);

        /* Set the I2S State ready */
        hi2s->State = DAL_I2S_STATE_READY;
        errorcode = DAL_ERROR;
      }
      else
      {
        /* Read DATA to Flush RX Data */
        READ_REG(I2SxEXT(hi2s->Instance)->DATA);
      }
    }
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */
  }

  else if ((hi2s->Init.Mode == I2S_MODE_MASTER_RX) || (hi2s->Init.Mode == I2S_MODE_SLAVE_RX))
  {
    /* Abort the I2S DMA rx Stream/Channel */
    if (hi2s->hdmarx != NULL)
    {
      /* Disable the I2S DMA rx Stream/Channel */
      if (DAL_OK != DAL_DMA_Abort(hi2s->hdmarx))
      {
        SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_DMA);
        errorcode = DAL_ERROR;
      }
    }
#if defined (SPI_I2S_FULLDUPLEX_SUPPORT)

    if (hi2s->State == DAL_I2S_STATE_BUSY_TX_RX)
    {
      /* Abort the I2S DMA tx Stream/Channel */
      if (hi2s->hdmatx != NULL)
      {
        /* Disable the I2S DMA tx Stream/Channel */
        if (DAL_OK != DAL_DMA_Abort(hi2s->hdmatx))
        {
          SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_DMA);
          errorcode = DAL_ERROR;
        }
      }

      tickstart = DAL_GetTick();

      /* Wait until TXE flag is set */
      while (__DAL_I2SEXT_GET_FLAG(hi2s, I2S_FLAG_TXE) != SET)
      {
        if (((DAL_GetTick() - tickstart) > I2S_TIMEOUT_FLAG))
        {
          /* Set the error code */
          SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);

          /* Set the I2S State ready */
          hi2s->State = DAL_I2S_STATE_READY;
          errorcode   = DAL_ERROR;
        }
      }

      /* Wait until BSY flag is Reset */
      while (__DAL_I2SEXT_GET_FLAG(hi2s, I2S_FLAG_BSY) != RESET)
      {
        if (((DAL_GetTick() - tickstart) > I2S_TIMEOUT_FLAG))
        {
          /* Set the error code */
          SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_TIMEOUT);

          /* Set the I2S State ready */
          hi2s->State = DAL_I2S_STATE_READY;
          errorcode   = DAL_ERROR;
        }
      }

      /* Disable I2Sext peripheral */
      __DAL_I2SEXT_DISABLE(hi2s);

      /* Clear UDR flag */
      __DAL_I2SEXT_CLEAR_UDRFLAG(hi2s);

      /* Disable the I2SxEXT DMA request */
      CLEAR_BIT(I2SxEXT(hi2s->Instance)->CTRL2, SPI_CTRL2_TXDEN);
    }
#endif /* SPI_I2S_FULLDUPLEX_SUPPORT */

    /* Disable I2S peripheral */
    __DAL_I2S_DISABLE(hi2s);

    /* Clear OVR flag */
    __DAL_I2S_CLEAR_OVRFLAG(hi2s);

    /* Disable the I2S Rx DMA request */
    CLEAR_BIT(hi2s->Instance->CTRL2, SPI_CTRL2_RXDEN);

    if (hi2s->Init.Mode == I2S_MODE_SLAVE_RX)
    {
      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, DAL_I2S_ERROR_BUSY_LINE_RX);

      /* Set the I2S State ready */
      hi2s->State = DAL_I2S_STATE_READY;
      errorcode = DAL_ERROR;
    }
    else
    {
      /* Read DATA to Flush RX Data */
      READ_REG((hi2s->Instance)->DATA);
    }
  }

  hi2s->State = DAL_I2S_STATE_READY;

  return errorcode;
}

/**
  * @brief  This function handles I2S interrupt request.
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
void DAL_I2S_IRQHandler(I2S_HandleTypeDef *hi2s)
{
  /* Call the IrqHandler ISR set during DAL_I2S_INIT */
  hi2s->IrqHandlerISR(hi2s);
}

/**
  * @brief  Tx Transfer Half completed callbacks
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
__weak void DAL_I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hi2s);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_I2S_TxHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Tx Transfer completed callbacks
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
__weak void DAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hi2s);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_I2S_TxCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Rx Transfer half completed callbacks
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
__weak void DAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hi2s);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_I2S_RxHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Rx Transfer completed callbacks
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
__weak void DAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hi2s);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_I2S_RxCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  I2S error callbacks
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @retval None
  */
__weak void DAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hi2s);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_I2S_ErrorCallback could be implemented in the user file
   */
}

/**
  * @}
  */

